var zodiac = [
    {
        msg:'<h1>属牛2019年运势及运程</h1>' +
            '<p>属牛的人进入2019年猪年，属牛为丑土，猪年为亥水，从命理上讲，土克水为财，所以属牛今年走财星之运，吉星有驿马和国印，所以财运上会有所起色。那么属牛人在2019年猪年运程的吉凶如何？走财星运之年有哪些需要注意的呢？下面卜易居老师结合周易命理，给大家详细讲解属牛2019年运势及运程：</p>' +
            '<img src="https://i.buyiju.com/wen/201806/3744/01.jpg">' +
            '<h6>属牛的人2019年运势综述</h6>' +
            '<p>1949年、1961年、1973年、1985年、1997年、2009年。</p>' +
            '<p>属牛的朋友，今年的运程比去年好得多，因为在去年有不小大的阻滞，而在今年则不一样，不过，因为受着丧门、大煞、飞廉和孤辰的影响，小阻滞总会有。丧门入主，表示容易跌伤，所以出入要小心，除自身之外，也要多关系老人家的健康。要注意的是，属牛者今年不宜探病，也不宜问丧。而大煞、飞廉凶星，也是代表容易受伤、遇上郊外，故喜欢进行危险活动的朋友，例如滑水、攀岩、跳伞等，便要格外留神。至于孤辰，会令属牛的你感觉孤单、无助，因别人不甚了解自己，致命情绪颇为低落，终日郁郁寡欢的。然而以上种种，都只是小问题罢了，因为有一颗地解星入主。地解属于贵人星，属牛的朋友将会得到有力人士的扶助，遇任何困难到最后都可获得解决，凡事可逢凶化吉，同时，这颗星亦代表搬迁，小则是家中合作出装修、更换家私，大则甚至会置业迁居。</p>' +
            '<p>此外，因有驿马和国印两颗吉星，事业发展可谓十分顺利。驿马代表走动、向外发展，而国印则是掌管权力的星宿，所以鼠年出生者，今年工作相当如意，甚至可升职！只是人际关系较差，要留意人事方面的问题，事关国印也代表着自尊心，属牛者今年往往会因为放不低自尊，又不敢表达自己的心意，致令与身边的人沟通不足，而就算产生误会了，也不会解释，甚至乎当遇到心仪对象时，亦不愿表明心仪、放胆追求。其实，你收藏掩饰自己的感受，只会害苦了自己。</p>' +
            '<h6>属牛人2019年财运运势</h6>' +
            '<p>由于驿马星在位，代表易得异地钱财，所以出门愈多，赚钱也愈多。做生意的朋友，本月可多接到外地顾客的订单，尤其是经营贸易者，多到外地参加展览，对生意更有帮助。另外，地解代表贵人，故从事跟人际关系有关行业的人士。工作会十分顺利，客源也有着搬迁的意思，所以属牛的你，今年可能会因为要为家居装修，甚至置业搬屋，以致花费多了。属牛人在今年不妨奉请一件“增庆堂”独家设计的“貔貅增庆饰品”随身佩戴，貔貅自古被民间视为招财的瑞兽，而该饰物之设计，也正是结合了民俗文化元素，寄托了在新年招财旺运的美好愿望。</p>' +
            '<h6>属牛人2019年事业运势</h6>' +
            '<p>前文提过，地解代表贵人，今年你在工作方面可得到上司的赏识、同事帮助，但要留意，这颗星也带有逢凶化吉的意思，所以很多时候会出现先难后易的情况，即是说你可能会先遇上阻滞，而在解决了过后，才可达到目标。另外，鼠年出生的人士今年的主星还包括驿马，表示打工一族会频频出门公干，若然选择离开本地工作，发展会更佳。然而，始终有大煞和飞廉等代表受伤的凶星在位，所以出差时要提防意外发生，也要小心看管财物。</p>' +
            '<h6>属牛人2019年感情运势</h6>' +
            '<p>属牛人今年事业得意，爱情却未如理想，带着孤辰入主，表示你今年孤单的时间可多呢，就算是正在蜜运的朋友，也会因为与对方聚少离多，而出现有伴侣等如没有伴侣之感，能够维持感情已算是不俗了。至于未有对象者，桃花运欠佳，继续会开单只影。反而由于受驿马的影响，可发展异地情缘，感情生活可更多姿多彩。异地桃花是指对方在外地出生，然后来本地发展、生活，或是当你身在外地时，邂逅于当地生活的对象。</p>' +
            '<p>小贴士：在民俗学上，葫芦寓意着爱情缘分以及家庭和睦，属牛之人今年不妨请一件“增庆堂福禄增庆葫芦”随身佩戴，或摆放在卧室，寓意新年和和美美，感情浓蜜。</p>' +
            '<h6>属牛人2019年健康运势</h6>' +
            '<p>当驿马遇着丧门、大煞、飞廉，就是指在出门期间容易发生小意外，导致身体受伤，或财物受损，幸而一切只是有惊无险。另外，平日出入，要当心跌伤撞损，尤其是老人家，小心一跌，也非同小可再重申一次，探病、问丧将会进一步减低你的能量，故为了自己的健康着想，还是不去为妙！开车的朋友呢，注意遵守交通规则，注意行车安全。喜欢车饰的属牛人，今年可在车上挂一串由“增庆堂”原创设计的“增庆堂三合白玉挂件”，寓意贵人扶持，出入平安。</p>' +
            '<h6>属牛人2019年吉祥物</h6>' +
            '<p>中华吉祥物文化渊远流长，自古以来，人们就将喜爱的动植物作为图腾或吉祥物，用以寄托吉祥寓意。根据传统的吉祥文化以及生肖命理学，属牛人可奉请“增庆堂神龟守岁”作为2019年吉祥物，其设计为一头赋于灵性的神龟，守望着两束稻穗。龟是华夏图腾崇拜中最负盛名的瑞兽之一，自古以来就是“长寿”的象征。龟蛇同属爬行动物，在中华四神中，北方之神——玄武，即是龟蛇组合。故在周易学上，龟蛇同为类属，而蛇鸡牛属生肖三合，所以龟可作为牛的三合贵神。而稻穗，表示丰收；穗谐音“岁”，两束稻穗为岁岁平安之意，也寓意经过辛勤的工作，获得财禄衣食丰厚。所以“增庆堂”的此款吉祥物饰品的文化元素结合了周易、佛道及民俗文化，寄托了对新年的美好祝福及愿景。若同时佩戴“增庆堂三合增庆红绳”，更增添吉祥寓意和彩头。</p>' +
            '<p>注意：属牛的吉祥物产品为专业吉祥文化品牌“增庆堂”独家设计并发售，从未对外授权或与他人合作，鉴于增庆堂的知名度，每年网络上均多有仿冒，从周易学及吉祥文化上讲，购买那些低价劣质的盗版吉祥物，就失去了吉祥文化的美好寓意。请缘友们认准增庆堂品牌，增庆堂在武汉，其它地方发货皆为假冒，请缘主切勿贪图小便宜！</p>'
    },
    {
        msg:'<h1>属猪2019年运势及运程</h1>' +
            '<p>属猪的人进入2019年猪年，是逢本命年，本命年运势一般有所阻滞不顺。另外从命理上讲，是亥亥相刑，也就是为本命年刑太岁之年，那么属猪人在2019年本命年的吉凶运势及运程如何？本命年犯太岁如何化解、并有哪些需要注意的呢？下面卜易居老师结合周易命理，给大家详细讲解属猪2019年本命年运势及运程：</p>' +
            '<img src="https://i.buyiju.com/wen/201806/3739/01.jpg">' +
            '<h6>属猪的人2019年运程综述</h6>' +
            '<p>1947年、1959年、1971年、1983年、1995年、2007年、2019年。</p>' +
            '<p>踏入2019年猪年，属猪的人今年迎来本命年，本命年属犯太岁的一种。很多人都以为，犯太岁便代表运程极差，其实并不尽然，犯太岁只是代表有相对的不顺，运势较为滞塞不畅。</p>' +
            '<p>所谓太岁当头坐，无喜必有祸，即是说，如犯太岁者在流年中有喜事，例如结婚、添丁，又或置业等，便可一喜挡三灾，令坏事化成喜事。否则，你就要有心理准备今年的变迁甚大，例如会出现搬屋、转工，以至感情生波折等事情。因犯太岁年亦同是感情离合年，故假若与伴侣不能结合，便有分手的可能。</p>' +
            '<p>不过，属猪人的你也不必太过担心，可有以下化解方法；家居方面，如果不迁居，则可作装修，至于工作方面，就算不转工，也可籍着出差、调职，来应验犯太岁运程多变的局面。</p>' +
            '<p>虽然属猪人今年犯太岁，但整体运势也不算太差，则且有三颗吉星照着你，包括华盖、岁驾和金匮。华盖代表领导才能的表现，令你可受到上司的常识，岁驾则有出巡的意思，即有升职的可能，表示你今年的事业运不俗，可得到发展，金匮则是一颗颇佳的财星，无论是正则或偏财，今年的收入也相当理想。</p>' +
            '<p>凶星方面，有剑锋、和自刑等作崇，会令你的身体健康较弱。剑锋代表受金属所伤，如果阁下的工作需要经常接触机器，便要格外留神，至于剑锋和自刑都主不利健康，属猪人的你，今年可能要接受手术，总之，犯太岁者多做善事便可趋吉避凶。</p>' +
            '<p>2019年己亥太岁神为谢太大将军，在民间，新年有拜太岁的风俗，2019年犯太岁的缘友们可在2018年岁末，或2019年新年后，按照传统民俗奉请一件【增庆堂谢太增庆福袋】摆放于家中或床头柜，寓意新年平平安安，祈福助运。</p>' +
            '<h6>属猪人2019年财运运势</h6>' +
            '<p>属猪人在2019年本命年财运如何？由于有金匮入主，所以无论正财或偏财运也不俗，有不少门路增加收入，此外，你在投机、投资偏财运方面亦甚有所斩获。不过，今年始终是属犯太岁年份，所以财运起落会比较大。</p>' +
            '<p>另一方面，由于有剑锋、三刑的存在，令身体健康欠佳，所以在医药费方面的支出亦是少不免。此外，上述两颗凶星也会影响你家人的身体健康，又会令你因此而破财。尽管如此，今年你的收入总能盖过支出，这将是禄得盈余的一年，不会受财务赤字的困扰。属猪人在今年不妨奉请一件“增庆堂”独家设计的“貔貅增庆饰品”随身佩戴，貔貅自古被民间视为招财的瑞兽，而该饰物之设计，也正是结合了民俗文化元素，寄托了在新年招财旺运的美好愿望。</p>' +
            '<h6>属猪人2019年事业运势</h6>' +
            '<p>属猪今年事业方面，因为犯太岁的关系，属猪人在工作方面会遇上变迁。此外，要留心今年做事容易节外生枝，波折重重，与同事、拍档的关系也紧张。</p>' +
            '<p>总括而言，属猪人的打工一族今年可有升职做生意者，公司业绩可有进步，甚至开枝散叶，扩大规模，涉足其他生意范畴，但建议不宜盲目投资，因为本命年不宜大投资，今年若有新的业务，做一些前期的准备工作即可。</p>' +
            '<h6>属猪人2019年感情运势</h6>' +
            '<p>今年因为犯太岁的关系，爱情路上较颠簸起伏。属猪人的男士今年的感情生活尚平淡稳定，属猪人的女士则起落较大。由于有伏尸、自刑在位，代表你与家人及伴侣的沟通会出现问题，容易产生误会而引起纷争。至于仍然单身未有伴侣的朋友，今年想遇上理想对象，机会则较为渺茫。人际关系方面，今年不及去年可广交朋友，不过，贵人运尚算稳定，与朋友相处关系融洽。</p>' +
            '<p>小贴士：在民俗学上，葫芦寓意着爱情缘分以及家庭和睦，您今年不妨请一件【增庆堂福禄增庆葫芦】随身佩戴，或摆放在卧室，寓意新年和和美美，感情浓蜜</p>' +
            '<h6>属猪人2019年健康运势</h6>' +
            '<p>属猪人的朋友，今年要注意身体健康。因为会有颇多的病痛，小患连连。再重申一次，剑锋被金属所伤，故在接触机器机械时，你要提防手脚受伤，另外，参与危险活动时，也要格外留神。对于女士而言，由于今年出现自已与自己相刑的情况，故要小心患上妇科病。</p>' +
            '<p>除了要注意自己的身体健康外，要留心本命年刑太岁带来的不利，还会影响着你家人的健康。记着，病向浅中医，就算是小病小痛，也不可掉以轻心，万一小事化大便麻烦了。开车的朋友呢，要遵守交通规则，小心驾驶，注意行车安全。属猪人不妨在车上挂一串“增庆堂三合白玉挂件”，寓意贵人扶持，出入平安。</p>' +
            '<h6>属猪人2019年吉祥物</h6>' +
            '<p>中华吉祥物文化渊远流长，自古以来，人们就将喜爱的动植物作为图腾或吉祥物，用以寄托吉祥寓意。根据传统的吉祥文化以及生肖命理学，属猪人可佩戴“增庆堂瑞虎增庆”作为2019年吉祥物，其设计为一只老虎雄居于宝葫芦之下，虎为百兽之王，在东方文化里，被视为驱灾解难的瑞兽，给人们带来福运和吉祥，生肖命理上，虎猪相合，所以虎是猪的六合贵人，代表贵人相助，寓意着对本命年运势的提升。葫芦谐音“福禄”，又是古代仙道医士随身佩戴、以盛装灵丹妙药的宝物，有祛病免灾、健康平安的喻意，亦代表感情和谐、家宅平安。所以该吉祥物饰品的文化元素结合了周易、佛道及民俗文化，寄托了对新年的美好祝福及愿景，若同时佩戴“增庆堂三合增庆红绳”，更增添吉祥寓意和彩头。</p>' +
            '<p>注意：属猪的吉祥物产品为专业吉祥文化品牌“增庆堂”独家设计并发售，从未对外授权或与他人合作，鉴于增庆堂的知名度，每年网络上均多有仿冒，购买那些低价劣质盗版吉祥物，就失去了吉祥的文化寓意。请缘友们认准增庆堂品牌，增庆堂在武汉，其它地方发货皆为假冒，请缘主切勿贪图小便宜！</p>'
    },
    {
        msg:'<h1>属狗2019年运势及运程</h1>' +
            '<p>属狗的人去年为本命年值太岁，运势不太顺遂。进入2019年猪年，运势有所改观。属狗地支五行为戌土，猪年为亥水，从命理上讲，土克水为财，所以属狗今年走财星之运，吉星有月德，所以财运上会有所获益。那么属狗人在2019年猪年运程的吉凶如何？走财星之年有哪些需要注意的呢？下面卜易居老师结合周易命理，给大家详细讲解属狗2019年运势及运程：</p>' +
            '<img src="https://i.buyiju.com/wen/201806/3738/01.jpg">' +
            '<h6>属狗的人2019年运势综述</h6>' +
            '<p>1946年、1958年、1970年、1982年、1994年、2006年、2018年</p>' +
            '<p>属狗的朋友去年变迁离合较多起伏颇大。踏入猪年，虽然平稳少少，但今年有“黄幡”和“病符”两颗凶星，影响落在人际关系及身体健康上。今年要特别提防小人暗中对付自己，但问题不是十分严重，至于健康方面，只要日常生活中作好保健，及多与朋友郊游作乐，多吸收大自然的清新空气，以平常心对待问题便可。</p>' +
            '<p>喜好今年有月德吉星来临，月德代表逢凶化吉、慈祥和悦，是表示人缘极好的星宿，故今年属狗者可得到贵人的扶助，令工作相当顺利。</p>' +
            '<p>然而，财运方面则不太理想，皆因有表示着破财、受骗小耗作崇。另外，又有劫煞和死符两颗同样代表危险的凶星在位；尤其是死符，会影响你和家中男性长者的身体健康。总括而言，今年属狗的朋友整体运势不会再像去年般波动，不会大起大落，但却又未至于平稳畅旺、事事如意。惟其如此，一切其实正在慢慢转好，给些时间耐性吧。</p>' +
            '<h6>属狗人2019年财运运势</h6>' +
            '<p>做生意的朋友，今年宜稳守阵地，不要开展新的业务，小试牛刀尚可，但太急功近利，则容易失败收场，因为财运方面，始终受着小耗凶星的影响，令你容易被拍档所骗，又会无缘无故破财。其望快种快收是不可能的了！今年只是耕种期而已。</p>' +
            '<p>幸而，有月德星帮助，得以逢凶化吉，到你山穷水尽的时候，总会有人相助扶你一把，另外，今年你的人缘颇佳，如果你的业务跟人际关系有关的话，那么生意相当不俗。惟独要注意的是，虽然收入是增加 了，但支出也有不少。属狗人在今年不妨佩戴一件“增庆堂三合增庆红绳”，寄托了在新年招财旺运的美好愿望。</p>' +
            '<h6>属狗人2019年事业运势</h6>' +
            '<p>属狗人今年由于受劫煞、死符所影响，今年工作上会发生颇多突发的意外，很多时候以为事情可以顺利完成，可是到了临门一脚，却生出枝节来，杀你一个措手不及，叫你应付不来。谨记凡事要有后备方案，就算是十拿九稳的事，都要以防万一。不过，其实属狗的朋友也不要太过忧心，始终也有贵人出现扶持，助你化险为夷。</p>' +
            '<p>对于打工一族而言，虽然今年未必有升职、加薪的机会，但只要视本度为播种期，默默耕耘，迟早都会有收获的。</p>' +
            '<h6>属狗人2019年感情运势</h6>' +
            '<p>去年因为犯太岁，分手运颇重，但若然有办喜事、即结婚或者添丁，则能挡去灾劫，不过，要是真的分手了，今年你的桃花过不算太旺盛，会处于寻寻觅觅的阶段。要留意的是，属狗的你，有机会在工作上碰到心仪对象，只是不宜太过急进 ，要给些时间去观察、了解对方是否适合自己；就算是开展了一段感情，与对方时常见面相处，但彼此的关系始终也没有重大突破。</p>' +
            '<p>小贴士：在民俗学上，葫芦寓意着爱情缘分以及家庭和睦，属狗之人今年不妨请一件“增庆堂福禄增庆葫芦”随身佩戴，或摆放在卧室，寓意新年和和美美，感情浓蜜。</p>' +
            '<h6>属狗人2019年健康运势</h6>' +
            '<p>健康方面，整体上比去年好，因为去年关节受冲，属狗者的手脚、腰骨部位容易受伤，今年情况则好转。然而，始终受着岁害和死符星所影响，今年会容易发生小意外，幸而有月德吉星在位，一切有惊无险。惟其如此，危险活动还是可免则免，应少参与为妙，因为属狗的你，今年略有失穷、被劫的运势，故在行山或身处偏僻地方时，要格外留神。开车的朋友呢，要遵守交通规则，小心驾驶，注意行车安全。属狗人不妨在车上挂一串“增庆堂三合白玉挂件”，寓意贵人扶持，出入平安。</p>' +
            '<h6>属狗人2019年吉祥物</h6>' +
            '<p>中华吉祥物文化渊远流长，自古以来，人们就将喜爱的动植物作为图腾或吉祥物，用以寄托吉祥寓意。根据传统的吉祥文化以及生肖命理学，属狗人可奉请“增庆堂宝骏聚福”作为2019年吉祥物，其设计为一匹奔腾的骏马，守护着如意宝瓶。自古以来，人们就有崇拜马图腾的习俗，无论出征战场，还是驱驰于商旅，都祈祷马神的庇护，以求成功平安归来。在周易命理学上，马又代表生意和财富，因为古代商品的流通运输，以马匹为主。虎马狗三合，所以马也是狗的三合贵人。宝瓶，驮于马鞍之上，谐音“平安”，宝瓶又称如意瓶，代表着家庭平安，爱情和美，亦有聚财、聚福的寓意。所以该吉祥物饰品的文化元素结合了周易、佛道及民俗文化，寄托了对新年的美好祝福及愿景，若同时佩戴“增庆堂三合增庆红绳”，更增添吉祥寓意。</p>' +
            '<p>注意：属狗的吉祥物产品为专业吉祥文化品牌“增庆堂”独家设计并发售，从未对外授权或与他人合作，鉴于增庆堂的知名度，每年网络上均多有仿冒，购买那些低价劣质盗版吉祥物，就失去了吉祥的文化寓意。请缘友们认准增庆堂品牌，增庆堂在武汉，其它地方发货皆为假冒，请缘主切勿贪图小便宜！</p>'
    },
    {
        msg:'<h1>属鸡2019年运势及运程</h1>'
    }
]