var zodiac = [
    {
        msg:'<img src="../../assets/images/yunshi/pic1.png">' +
            '<div>属羊的人进入2019年猪年，属羊为未土，猪年为亥水，从命理上讲，亥未三合，而土克水为财，所以属羊今年走财星和贵人运，吉星有三台、天解，所以今年运势相当不错。那么属羊人在2019年猪年运程的吉凶如何？三合之年有哪些需要注意的呢？下面卜易居老师结合周易命理，给大家详细讲解属羊2019年运势及运程：</div>' +
            '<h6>属羊的人2019年运势综述</h6>' +
            '<p>1943年、1955年、1967年、1979年、1991年、2003年、2015年。<br>' +
            '属羊人进入猪年，今年有好几颗吉星高照着你。包括三台、天解、将星。三台表示事业进步，步步高升，尤其对公务员或大机构员工而言，更为有利。天解有着问题得以解决的意思，但要有心理准备既然是有困难需要解决，那即是说你在做事时会遇到阻滞，幸而及至最后得到贵人相助，一切化险为夷。至于将星，代表升职加薪，尤其对从老板来讲，今年可得到好的下属，作为员工你的能力会得到认同。以上吉星都对工作有利。<br>' +
            '不过，在事业有成的同时，你的情绪却欠佳，皆因受着五鬼、官符、浮沉、黄幡几颗凶星的影响。<br>' +
            '五鬼令你常疑神疑鬼、心神不定；同时，五鬼也表示有小人当道；官符代表官非诉讼，故在处理文件合约时，要额外小心留神，慎防被骗利用；至于浮沉，代表感情会出现热情减退的迹象；黄幡则是指老人家的身体健康较差。</p>' +
            '<h6>属羊的人2019年财运运势</h6>' +
            '<p>三颗吉星都对事业有利，所以今年你的财运来自正财为主，尤其是三台，有着步步高升的意思，所以属羊的你今年获升职、加薪的机会极大。至于偏财则不太理想，因为浮沉代表起伏波动，如参与炒卖投机活动，须坚守见好即收的原则，否则钱财赢回来了，到最后却总输掉，这还不止，浮沉其实也会影响你的正财运。要特别注意的是，由于官符入主，你易惹上官非而损耗钱财，所以在处理合约、买卖时，要了解清楚条款，宜向专业人士咨询意见。</p>' +
            '<h6>属羊的人2019年事业运势</h6>' +
            '<p>三台吉星代表事业拾级而上，尤其是公务员或在大机构任职者，工作表现极之突出，有步步高升之势。将星主宰才华、创作能力，你今年思维清晰，想出的计划别具创新，同时又得到别人的欣赏和认同，要是你的工作与创作有关，例如广告、传媒，那么你便如鱼得水，灵感源源不断！最重要的是，有天解入主，即表示你在遇到任何困难时，都有贵人相助，无难后易，先苦后甜。</p>' +
            '<h6>属羊的人2019年感情运势</h6>' +
            '<p>属羊的人今年受到浮沉凶星所影响，今年你的感情生活易起波折，会浓情转淡；而华盖则有着孤寂。另外，五反当道，令你时常会胡思乱想，认为伴侣对你不好，有事隐瞒，而且又有些小人在旁边扇风点火，推波助澜，更令你与伴侣之间的嫌隙渐生，关系日渐疏离。其实，遇上不称心事时，开心见诚说出来才是解决相处问题之道。至于人际关系方面，今年你要注意容易与人发生拗撬。故建议若然事不关已，还是少理为妙。<br>' +
            '小贴士：在民俗学上，葫芦寓意着爱情缘分以及家庭和睦，属羊之人今年不妨请一件“增庆堂”独家设计的“福禄增庆葫芦”随身佩戴，或摆放在卧室，寓意新年和和美美，感情浓蜜。</p>' +
            '<h6>属羊的人2019年健康运势</h6>' +
            '<p>今年五鬼影响着你的健康，会令你睡得不稳、心神不定，尤其在农历二月及五月，要尽量避免上夜街和至偏僻的地方。另外，浮沉暗示著水险轻则会被雨淋病；重则会遇弱，故喜爱水上活动的人士，要小心思上。开车的朋友呢，注意遵守交通规则，注意行车安全。</p>'
    },
    {
        msg:'<img src="../../assets/images/yunshi/pic2.png">' +
            '<div>属猴的人进入2019年猪年，属猴地支五行为申金，猪年为亥水，从五行命理上讲，为金水相生之年，走食伤之运，同时因为申亥相害，也是害太岁之年，运势有喜有忧。那么属猴人在2019年猪年运程的吉凶如何？害太岁之年如何化解、又有哪些需要注意的呢？下面卜易居老师结合周易命理，给大家详细讲解属猴2019年运势及运程：</div>' +
            '<h6>属猴的人2019年运势综述</h6>' +
            '<p>1944年、1956年、1968年、1980年、1992年、2004年、2016年。<br>' +
            '属猴的朋友，今年没有主星在位，没有主星，运势便等如没有了根、没有依归，因此非常反复、上落极大。遇上这种情况，玄学上可借用对宫吉星来照耀自己。所以今年属猴的朋友，可得到太阳、唐符的帮助；不过，借来的力量只有原本的三成而已。加之上流年犯害太岁，属猴的人士要有心理准备，将要度过障碍重重的一年。<br>' +
            '首先，运势反复，做事频生枝节，发展出人意表，以为胜券在握的事情，却波澜重重。另外，因为本宫有著代表意外惊吓的天狗入主，所以健康运不太理想。出门公干、旅游时要分外小心，最好购买旅游保险，以策安全。幸好借助了太阳、唐符的力量，当遇上困难时，总有贵人相助，凡事也能逢凶化吉。2019年己亥太岁神为谢太大将军，在民间，新年有拜太岁的风俗，2019年犯太岁的缘友们可在2018年岁末，或2019年新年后，按照传统民俗奉请一件【增庆堂谢太增庆福袋”摆放于家中或床头柜，寓意新年平平安安，祈福助运。<br>' +
            '凶星方面还有寡宿当道，顾名思义，寡宿者，一个人独睡也，表示与伴侣的感情关系淡薄，或者配偶的身体健康会出现问题，虽然华盖代表才华得到发挥，但是亦有点孤芳自赏、只影形单的味道，所以属猴者今年总觉得孤独寂寞，没有人了解自己似的。<br>' +
            '此外，吊客、披头亦在位，表示家中长辈的健康易出现问题，家宅运颇弱，要多加关心家人的身体状况，就算只是小毛病，也要看医生治理。建议今年不要探病等，以免进一步影响运势。</p>' +
            '<h6>属猴的人2019年财运运势</h6>' +
            '<p>没有吉星的入主，只能借助对宫吉星的力量，即太阳、唐符等。太阳代表男性贵人，男性朋友更能得以发挥，所以从事创作行业的人士，将甚有成就；否则，运势则欠佳，将遇到不少棘手的问题。建议凡事作好两手准备，这边失败了，还有第二条路可走。幸好有天解这颗贵人星帮助，所以当遇到困难之时，不妨向亲友长辈求助，问题将可迎刃而解。在如此环境之下，只要亲力亲为努力耕耘，正财尚算过得去，略有进账；不过，偏财则不能强求了。</p>' +
            '<h6>属猴的人2019年事业运势</h6>' +
            '<p>整体而言，因为有三台吉星的关系，事业将进步，尤其在政府、大机构任职的人士，大有机会升职、加薪。不过，心情却稍差，总觉得孤单作战，没有人可帮助自己。得到对宫华盖星的力量，今年艺术才华得以发挥，但是，此颗星也有孤芳自赏的意思，所以今年你与上司、下属的沟通不足。无疑，只要自己做好分内的事，便不用在意别人的看法，然而，我们始终活于群体社会当中，合作、团队精神是很重要的，宜多作沟通，做事便事半功倍。</p>' +
            '<h6>属猴的人2019年感情运势</h6>' +
            '<p>如前文所说，寡宿代表孤家寡人，所以还未拍拖的人士，今年想遇到理想对象则难矣。就算给你碰上了，也会发觉对方的条件不够理想，配不起自己，又或嫌人家的思想未够成熟等，总之彼此未能发展出姻缘。至于已有伴侣或已婚者，则会因为对方工作很忙而少了时间相处。人际关系方面，披头有仪表稍逊的意思，所以你今年易因不修边幅、性格不羁而惹人非议，不过，实际上的影响并不大。小贴士：在民俗学上，葫芦寓意着爱情缘分以及家庭和睦，属猴之人今年不妨请一件“增庆堂”独家设计的“福禄增庆葫芦”随身佩戴，或摆放在卧室，寓意新年和和美美，感情浓蜜。</p>' +
            '<h6>属猴的人2019年健康运势</h6>' +
            '<p>天狗代表意外惊吓，虽然最后都是有惊无险，但经常在外地公干的人士，还是要小心为上。另外，披头会影响着老人家的身体健康，宜预早做检查以求个安心。至于自身身体问题不大，只是情绪较为低落罢了，建议就算一个人也可以出外走走，又或者发展一些新爱好，如觉得压力太大时，参加一些兴趣活动也是好的。开车的朋友呢，注意遵守交通规则，注意行车安全。喜欢车饰的属猴人，今年可在车上挂一串由“增庆堂”原创设计的“增庆堂三合白玉挂件”，寓意贵人扶持，出入平安。</p>'
    },
    {
        msg:'<img src="../../assets/images/yunshi/pic3.png">' +
            '<div>属鸡的人进入2019年猪年，属鸡五行地支为酉金，猪年为亥水，从命理上讲，为金水相生之年，走食伤之运，代表技艺和才能方面的运势。那么属鸡人在2019年猪年运程的具体吉凶如何？金水相生之年有哪些需要注意的呢？下面卜易居老师结合周易命理，给大家详细讲解属鸡2019年运势及运程：</div>' +
            '<h6>属鸡的人2019年运势综述</h6>' +
            '<p>1945年、1957年、1969年、1981年、1993年、2005年、2017年。<br>' +
            '属鸡人士今年没有特别重要的吉星入主，运势犹如没有根一样，非常飘忽，起落甚大。遇上这种情况。在玄学上可以借助对宫的星宿来照耀自己。不过，由于只是借助，吉星所发挥的力量仅是原有的三成，聊胜于无而已。所以，属鸡者今年勉强算有地解和驿马两颗吉星高照。<br>' +
            '另一边，本宫却有四颗凶星在位，分别是白虎、天雄、指背和的煞。属鸡的朋友今年要有心理准备去迎接种种挑战。首先，做事会阻滞重重，以为胜券在握，却频生枝节，另外，人事方面也十分复杂，是非口舌固然多，且还会被同事在背后语言中伤，有万箭穿心之感。<br>' +
            '事事不响，惟有借助对宫的驿马吉星力量。今年你适宜走动、出门。地解有地域变动的意思，也就是说如果今年会搬写字楼或迁居，也有助趋吉避凶。</p>' +
            '<h6>属鸡的人2019年财运运势</h6>' +
            '<p>由于没有吉星入主，明显地，今年的财运不太如意。特别是做生意的朋友，经营环境不甚理想，虽然未至于亏蚀，但钱财总是得来不易，经营计划要不断推陈出新，才可增加客源招来生意。</p>' +
            '<h6>属鸡的人2019年事业运势</h6>' +
            '<p>属鸡的打工一族，今年常会被同事在背后中伤，令自己得不到上司的信任，所以心里总想转工，又或者因工作成绩不尽如意而怀疑自己是否适应这份工作。如前文所说，由于没有吉星在位，属鸡人士今年像没有根一样，不有方向，飘忽不定。建议你默默工作，做好本分，给点时间看清楚环境，然后才衡量自己是否适合现职工作未为迟退。至于想告别打工生涯、出外创业的话，今年并不是适当的时机。</p>' +
            '<h6>属鸡的人2019年感情运势</h6>' +
            '<p>属鸡男士今年所遇到的女孩子，性格都比较固执，绝对不是小鸟依人的类型。这样如果你本身比较喜欢坚强独立、极有主见的女孩子，这便不是问题，否则便会跟对方频生争执。另外，就算遇到理想对象，可是对方的朋友，以至家人，也未必接受你，最终影响你和她感情。女士方面，如未有拍拖的话，今年恐怕仍然未有着落；而已有伴侣的，则会略受感情困扰，幸而最都能逢凶化吉，一切维持原状。<br>' +
            '小贴士：在民俗学上，葫芦寓意着爱情缘分以及家庭和睦，属鸡之人今年不妨请一件“增庆堂福禄增庆葫芦”随身佩戴，或摆放在卧室，寓意新年和和美美，感情浓蜜。</p>' +
            '<h6>属鸡的人2019年健康运势</h6>' +
            '<p>属鸡者今年要注意牙齿健康，可能需要修补，甚至做小手术。另外，容易被动物咬伤，以及会遇上小危险，因而受到惊吓。要注意交通安全，避免参与具危险性的活动。开车的朋友呢，注意遵守交通规则，注意行车安全。喜欢车饰的属鸡人，今年可在车上挂一串由“增庆堂”原创设计的“增庆堂三合白玉挂件”，寓意贵人扶持，出入平安。</p>'
    },
    {
        msg:'<img src="../../assets/images/yunshi/pic4.png">' +
            '<div>属狗的人去年为本命年值太岁，运势不太顺遂。进入2019年猪年，运势有所改观。属狗地支五行为戌土，猪年为亥水，从命理上讲，土克水为财，所以属狗今年走财星之运，吉星有月德，所以财运上会有所获益。那么属狗人在2019年猪年运程的吉凶如何？走财星之年有哪些需要注意的呢？下面卜易居老师结合周易命理，给大家详细讲解属狗2019年运势及运程：</div>' +
            '<h6>属狗的人2019年运势综述</h6>' +
            '<p>1946年、1958年、1970年、1982年、1994年、2006年、2018年。<br>' +
            '属狗的朋友去年变迁离合较多起伏颇大。踏入猪年，虽然平稳少少，但今年有“黄幡”和“病符”两颗凶星，影响落在人际关系及身体健康上。今年要特别提防小人暗中对付自己，但问题不是十分严重，至于健康方面，只要日常生活中作好保健，及多与朋友郊游作乐，多吸收大自然的清新空气，以平常心对待问题便可。<br>' +
            '喜好今年有月德吉星来临，月德代表逢凶化吉、慈祥和悦，是表示人缘极好的星宿，故今年属狗者可得到贵人的扶助，令工作相当顺利。<br>' +
            '然而，财运方面则不太理想，皆因有表示着破财、受骗小耗作崇。另外，又有劫煞和死符两颗同样代表危险的凶星在位；尤其是死符，会影响你和家中男性长者的身体健康。总括而言，今年属狗的朋友整体运势不会再像去年般波动，不会大起大落，但却又未至于平稳畅旺、事事如意。惟其如此，一切其实正在慢慢转好，给些时间耐性吧。</p>' +
            '<h6>属狗的人2019年财运运势</h6>' +
            '<p>做生意的朋友，今年宜稳守阵地，不要开展新的业务，小试牛刀尚可，但太急功近利，则容易失败收场，因为财运方面，始终受着小耗凶星的影响，令你容易被拍档所骗，又会无缘无故破财。其望快种快收是不可能的了！今年只是耕种期而已。</p>' +
            '<h6>属狗的人2019年事业运势</h6>' +
            '<p>属狗人今年由于受劫煞、死符所影响，今年工作上会发生颇多突发的意外，很多时候以为事情可以顺利完成，可是到了临门一脚，却生出枝节来，杀你一个措手不及，叫你应付不来。谨记凡事要有后备方案，就算是十拿九稳的事，都要以防万一。不过，其实属狗的朋友也不要太过忧心，始终也有贵人出现扶持，助你化险为夷。<br>' +
            '对于打工一族而言，虽然今年未必有升职、加薪的机会，但只要视本度为播种期，默默耕耘，迟早都会有收获的。</p>' +
            '<h6>属狗的人2019年感情运势</h6>' +
            '<p>去年因为犯太岁，分手运颇重，但若然有办喜事、即结婚或者添丁，则能挡去灾劫，不过，要是真的分手了，今年你的桃花过不算太旺盛，会处于寻寻觅觅的阶段。要留意的是，属狗的你，有机会在工作上碰到心仪对象，只是不宜太过急进 ，要给些时间去观察、了解对方是否适合自己；就算是开展了一段感情，与对方时常见面相处，但彼此的关系始终也没有重大突破。</p>' +
            '<h6>属狗的人2019年健康运势</h6>' +
            '<p>健康方面，整体上比去年好，因为去年关节受冲，属狗者的手脚、腰骨部位容易受伤，今年情况则好转。然而，始终受着岁害和死符星所影响，今年会容易发生小意外，幸而有月德吉星在位，一切有惊无险。惟其如此，危险活动还是可免则免，应少参与为妙，因为属狗的你，今年略有失穷、被劫的运势，故在行山或身处偏僻地方时，要格外留神。</p>'
    },

    {
        msg:'<img src="../../assets/images/yunshi/pic5.png">' +
            '<div>属猪的人进入2019年猪年，是逢本命年，本命年运势一般有所阻滞不顺。另外从命理上讲，是亥亥相刑，也就是为本命年刑太岁之年，那么属猪人在2019年本命年的吉凶运势及运程如何？本命年犯太岁如何化解、并有哪些需要注意的呢？下面卜易居老师结合周易命理，给大家详细讲解属猪2019年本命年运势及运程：</div>' +
            '<h6>属猪的人2019年运势综述</h6>' +
            '<p>1947年、1959年、1971年、1983年、1995年、2007年、2019年。<br>' +
            '踏入2019年猪年，属猪的人今年迎来本命年，本命年属犯太岁的一种。很多人都以为，犯太岁便代表运程极差，其实并不尽然，犯太岁只是代表有相对的不顺，运势较为滞塞不畅。<br>' +
            '所谓太岁当头坐，无喜必有祸，即是说，如犯太岁者在流年中有喜事，例如结婚、添丁，又或置业等，便可一喜挡三灾，令坏事化成喜事。否则，你就要有心理准备今年的变迁甚大，例如会出现搬屋、转工，以至感情生波折等事情。因犯太岁年亦同是感情离合年，故假若与伴侣不能结合，便有分手的可能。<br>' +
            '不过，属猪人的你也不必太过担心，可有以下化解方法；家居方面，如果不迁居，则可作装修，至于工作方面，就算不转工，也可籍着出差、调职，来应验犯太岁运程多变的局面。<br>' +
            '虽然属猪人今年犯太岁，但整体运势也不算太差，则且有三颗吉星照着你，包括华盖、岁驾和金匮。华盖代表领导才能的表现，令你可受到上司的常识，岁驾则有出巡的意思，即有升职的可能，表示你今年的事业运不俗，可得到发展，金匮则是一颗颇佳的财星，无论是正则或偏财，今年的收入也相当理想。<br>' +
            '凶星方面，有剑锋、和自刑等作崇，会令你的身体健康较弱。剑锋代表受金属所伤，如果阁下的工作需要经常接触机器，便要格外留神，至于剑锋和自刑都主不利健康，属猪人的你，今年可能要接受手术，总之，犯太岁者多做善事便可趋吉避凶。</p>' +
            '<h6>属猪的人2019年财运运势</h6>' +
            '<p>属猪人在2019年本命年财运如何？由于有金匮入主，所以无论正财或偏财运也不俗，有不少门路增加收入，此外，你在投机、投资偏财运方面亦甚有所斩获。不过，今年始终是属犯太岁年份，所以财运起落会比较大。</p>' +
            '<h6>属猪的人2019年事业运势</h6>' +
            '<p>属猪今年事业方面，因为犯太岁的关系，属猪人在工作方面会遇上变迁。此外，要留心今年做事容易节外生枝，波折重重，与同事、拍档的关系也紧张。<br>' +
            '总括而言，属猪人的打工一族今年可有升职做生意者，公司业绩可有进步，甚至开枝散叶，扩大规模，涉足其他生意范畴，但建议不宜盲目投资，因为本命年不宜大投资，今年若有新的业务，做一些前期的准备工作即可。</p>' +
            '<h6>属猪的人2019年感情运势</h6>' +
            '<p>今年因为犯太岁的关系，爱情路上较颠簸起伏。属猪人的男士今年的感情生活尚平淡稳定，属猪人的女士则起落较大。由于有伏尸、自刑在位，代表你与家人及伴侣的沟通会出现问题，容易产生误会而引起纷争。至于仍然单身未有伴侣的朋友，今年想遇上理想对象，机会则较为渺茫。人际关系方面，今年不及去年可广交朋友，不过，贵人运尚算稳定，与朋友相处关系融洽。</p>' +
            '<h6>属猪的人2019年健康运势</h6>' +
            '<p>属猪人的朋友，今年要注意身体健康。因为会有颇多的病痛，小患连连。再重申一次，剑锋被金属所伤，故在接触机器机械时，你要提防手脚受伤，另外，参与危险活动时，也要格外留神。对于女士而言，由于今年出现自已与自己相刑的情况，故要小心患上妇科病。<br>' +
            '除了要注意自己的身体健康外，要留心本命年刑太岁带来的不利，还会影响着你家人的健康。记着，病向浅中医，就算是小病小痛，也不可掉以轻心，万一小事化大便麻烦了。</p>'
    },
    {
        msg:'<img src="../../assets/images/yunshi/pic6.png">' +
            '<div>属鼠的人进入2019年猪年，从命理上讲，猪年五行为亥水，子鼠逢亥水，是身旺之年，身旺者虽能激自身的才能，但往往有劫财之虞。那么属鼠人在2019年猪年运程的吉凶如何？身旺之年有哪些需要注意的呢？下面卜易居老师结合周易命理，给大家详细讲解属鼠2019年运势及运程：</div>' +
            '<h6>属鼠的人2019年运势综述</h6>' +
            '<p>1948年、1960年、1972年、1984年、1996年、2008年。<br>' +
            '属鼠的朋友，去年运势有些压力。今年则转趋平稳。不过，由于陌越、病符和亡神三颗凶星在作崇，运势虽然稳定，但仍有少许暗涌。陌越代表陌生环境、变迁，表示就算你于去年已转换了工作，但到了今年，仍可能还要再转工。属鼠人今年在财运方面开支会较大，令你陷进先入不敷出的境地，但正财、偏财都不俗，虽然未至于禄得盈余，但总算能够收支平稳，不会出现赤字。<br>' +
            '病符表示身体健康欠佳，小病小痛无可避免了。至于亡神，表示可能要出席丧礼，今年要加倍关心家中长者的健康。虽然运势稍有上落，但属鼠人士却不必太过担心，因为有天乙吉星入主。天乙是一颗贵人星，今年在遇到阻碍波折时，都有贵人出现帮助你、问题可迎刃而解，此外，家人、朋友对你都十分支持。</p>' +
            '<h6>属鼠的人2019年财运运势</h6>' +
            '<p>属鼠的做生意之人，今年可以开拓新业务，将延伸到其他范畴。由于出现陌越的关系，今年适宜搬写字楼或店铺，这些变动将会带来好运，令收入增加，另外，属鼠的人士可得到不少贵人的帮助，获得意见、贴士而得财，这些贵人包括兄弟姐妹、父母及朋友。不过，今年属播种、耕耘期，不要心急求成，凡事亲力亲为，默默地干，努力之后便会有所收成。</p>' +
            '<h6>属鼠的人2019年事业运势</h6>' +
            '<p>属鼠的打工一族，今年略有升职运，不过，有名无利，名誉是提高了，但实际得着却未必有。权力大了，工作多了，却未有加薪，也不用太过介怀，只要你好好地干，做出成绩，迟早都可有回报。如前文所说，陌越代表陌生的环境，所以今年可能会搬写字楼、换上司，同事间也会出现许多新面孔，不过，请放心，这些变迁都是好的，你很快便能适应下来。<br>' +
            '如果属鼠的你打算转工，今年是大好时机，只要避开农历二月和八月便可以了。另外，今年因为工作繁重，令你疲于奔命，牺牲了作息时间。</p>' +
            '<h6>属鼠的人2019年感情运势</h6>' +
            '<p>如果去年刚刚结婚的，今年则会进入添丁运。相反，若然去年与伴侣分手了，想在今年遇上对象，开展一段新感情的话，就要靠同事、朋友、长辈帮忙介绍了。总之，今年要结识心仪对象，必须由别人穿针引线，于今年所邂逅到的人，条件不俗，对方对人铁事业又有不秒的助力。人际关系方面，与上司、同事、下属相处融洽。是非口舌极少，只是在新的环境中，未必能在短期内适应，要慢慢地习惯。</p>' +
            '<h6>属鼠的人2019年健康运势</h6>' +
            '<p>属鼠人今年受到病符影响，见其名知其义，今年属鼠人士的健康欠佳，会有颇多小毛病，头晕、发烧、伤风、感冒等频发。另外，因为工作繁忙，所以会感到巨大压力。若然出外公干、旅行，要小心水土不服，宜多加注意饮食。亡神表示有机会出席喪礼，在此提点你自己要保重身体之余，也要加倍留心家中长者的健康，无论患上什么毛病，都必定要看医生，病向浅中医。这些支出是少不免的。</p>'
    },
    {
        msg:'<img src="../../assets/images/yunshi/pic7.png">' +
            '<div>属牛的人进入2019年猪年，属牛为丑土，猪年为亥水，从命理上讲，土克水为财，所以属牛今年走财星之运，吉星有驿马和国印，所以财运上会有所起色。那么属牛人在2019年猪年运程的吉凶如何？走财星运之年有哪些需要注意的呢？下面卜易居老师结合周易命理，给大家详细讲解属牛2019年运势及运程：</div>' +
            '<h6>属牛的人2019年运势综述</h6>' +
            '<p>1949年、1961年、1973年、1985年、1997年、2009年。<br>' +
            '属牛的朋友，今年的运程比去年好得多，因为在去年有不小大的阻滞，而在今年则不一样，不过，因为受着丧门、大煞、飞廉和孤辰的影响，小阻滞总会有。丧门入主，表示容易跌伤，所以出入要小心，除自身之外，也要多关系老人家的健康。要注意的是，属牛者今年不宜探病，也不宜问丧。而大煞、飞廉凶星，也是代表容易受伤、遇上郊外，故喜欢进行危险活动的朋友，例如滑水、攀岩、跳伞等，便要格外留神。至于孤辰，会令属牛的你感觉孤单、无助，因别人不甚了解自己，致命情绪颇为低落，终日郁郁寡欢的。然而以上种种，都只是小问题罢了，因为有一颗地解星入主。地解属于贵人星，属牛的朋友将会得到有力人士的扶助，遇任何困难到最后都可获得解决，凡事可逢凶化吉，同时，这颗星亦代表搬迁，小则是家中合作出装修、更换家私，大则甚至会置业迁居。<br>' +
            '此外，因有驿马和国印两颗吉星，事业发展可谓十分顺利。驿马代表走动、向外发展，而国印则是掌管权力的星宿，所以鼠年出生者，今年工作相当如意，甚至可升职！只是人际关系较差，要留意人事方面的问题，事关国印也代表着自尊心，属牛者今年往往会因为放不低自尊，又不敢表达自己的心意，致令与身边的人沟通不足，而就算产生误会了，也不会解释，甚至乎当遇到心仪对象时，亦不愿表明心仪、放胆追求。其实，你收藏掩饰自己的感受，只会害苦了自己。</p>' +
            '<h6>属牛的人2019年财运运势</h6>' +
            '<p>由于驿马星在位，代表易得异地钱财，所以出门愈多，赚钱也愈多。做生意的朋友，本月可多接到外地顾客的订单，尤其是经营贸易者，多到外地参加展览，对生意更有帮助。另外，地解代表贵人，故从事跟人际关系有关行业的人士。工作会十分顺利，客源也有着搬迁的意思，所以属牛的你，今年可能会因为要为家居装修，甚至置业搬屋，以致花费多了。</p>' +
            '<h6>属牛的人2019年事业运势</h6>' +
            '<p>前文提过，地解代表贵人，今年你在工作方面可得到上司的赏识、同事帮助，但要留意，这颗星也带有逢凶化吉的意思，所以很多时候会出现先难后易的情况，即是说你可能会先遇上阻滞，而在解决了过后，才可达到目标。另外，鼠年出生的人士今年的主星还包括驿马，表示打工一族会频频出门公干，若然选择离开本地工作，发展会更佳。然而，始终有大煞和飞廉等代表受伤的凶星在位，所以出差时要提防意外发生，也要小心看管财物。<br>' +
            '对于打工一族而言，虽然今年未必有升职、加薪的机会，但只要视本度为播种期，默默耕耘，迟早都会有收获的。</p>' +
            '<h6>属牛的人2019年感情运势</h6>' +
            '<p>属牛人今年事业得意，爱情却未如理想，带着孤辰入主，表示你今年孤单的时间可多呢，就算是正在蜜运的朋友，也会因为与对方聚少离多，而出现有伴侣等如没有伴侣之感，能够维持感情已算是不俗了。至于未有对象者，桃花运欠佳，继续会开单只影。反而由于受驿马的影响，可发展异地情缘，感情生活可更多姿多彩。异地桃花是指对方在外地出生，然后来本地发展、生活，或是当你身在外地时，邂逅于当地生活的对象</p>' +
            '<h6>属牛的人2019年健康运势</h6>' +
            '<p>当驿马遇着丧门、大煞、飞廉，就是指在出门期间容易发生小意外，导致身体受伤，或财物受损，幸而一切只是有惊无险。另外，平日出入，要当心跌伤撞损，尤其是老人家，小心一跌，也非同小可再重申一次，探病、问丧将会进一步减低你的能量，故为了自己的健康着想，还是不去为妙！</p>'
    },
    {
        msg:'<img src="../../assets/images/yunshi/pic8.png">' +
            '<div>属虎的人进入2019年猪年，生肖地支和流年地支寅亥相合，是为贵人带合之年，但同时亦有破太岁之象，所以属虎今年有吉有凶。那么属虎人在2019年猪年运程的吉凶如何？破太岁之年如何化解、有哪些需要注意的呢？下面卜易居老师结合周易命理，给大家详细讲解属虎2019年运势及运程：</div>' +
            '<h6>属虎的人2019年运势综述</h6>' +
            '<p>1950年、1962年、1974年、1986年、1998年、2010年。<br>' +
            '从事玄学角度看，属虎者的年支与流年的地支相破，即属虎人在今年会犯太岁，所以，生肖属虎人士今年的运程阻滞。虽说是犯太岁，但属虎人士不会像其他犯太岁者一般，上落变化很大，朋友，会有人介绍不反实际上运势并不太差，只不过郁闷不欢罢了。吉星方面今年有太阴和唐符。太阴是男人贵人星。由于太阴照射得比较远，所以代表会向外发展，唐符则代表权责、声望，今年你的领导能力得到认同，在工作时又充满灵感，朝气索然的。两颗星集合起来，令属虎者今年的发展相当不俗，表现得到赞赏，努力得到回报。<br>' +
            '虽然事业顺境，可是人际关系却不济，因为有破星、晦气、阴煞和板鞍三颗凶星入主。破星代表欠缺沟通，易生误会，晦气表示别人对你埋怨连连，阴煞则是女性会为自己带来烦恼。这一切显示今年你与同事、拍档。以至伴侣的关系欠理想，别人对你不满，双方争吵又频频。记着切忌锋过露，应以礼待人，工作不止是一个人的成就，你的世界也不可能只你一个人。</p>' +
            '<h6>属虎的人2019年财运运势</h6>' +
            '<p>因为有太阴星在位的关系，今年你将会得到男性贵人的帮助。属虎的打工一族，如果你的老板是一位男士，那么你便有升职、加薪的机会，至于做生意的朋友，会有人介绍不少生意给你，令公司的营业额大增，偏财方面，你可得到贵人的帮助，另外，属虎人士今年的财运有一个特色，就是可以赚到外地钱财。如果你的公司是外国客户生意，可多出门到外地，你的赚钱机会会大增。</p>' +
            '<h6>属虎的人2019年事业运势</h6>' +
            '<p>今年由于出现太阴这颗吉星的关系，再加上有代表着进步的唐符，属虎的你，今年事业发展相当不俗。因为唐符也表示着朝气勃然，所双你在工作时充满能量，思路也特别清晰，尤其是从事武职工作人士。例如警察、海关人员、消防员等，能力得到发挥，又有升职机会。如果有意转工、转行的话，今年也是适当的时机，能够找到一份理想的工作。</p>' +
            '<h6>属虎的人2019年感情运势</h6>' +
            '<p>属虎的女士，今年的感情运比属虎的男士好得多。太阴星代表男性贵人，降在工作方面可得到男性上司的提携扶助外，在感情方面也可遇到原有成就的理想对象。受到男性上司的赏识之余，你跟对方甚至有可能发展恋情。总之一句，属虎的女士，今年要好好把握机会！至于属虎的男士，今年便，没那么幸运了，皆因受着晦气和阴煞凶星的影响，感情方面只能原地踏步，单身者继续没着落，已有伴侣者，温情甚至会转淡。</p>' +
            '<h6>属虎的人2019年健康运势</h6>' +
            '<p>小病小能是有的，例如皮肤、肠胃等容易敏感、发炎，但大问题则没有。今年你到年地公干时，容易水土不服，总之要注意饮食，小心病从口入。</p>'
    },
    {
        msg:'<img src="../../assets/images/yunshi/pic9.png">' +
            '<div>属兔的人进入2019年猪年，属兔五行地支为卯木，猪年为亥水，从命理上讲，为亥卯三合之年，所以属兔今年走吉星之运，但神煞有勾神和贯索，又代表运势的迟滞不畅。那么属兔人在2019年猪年运程的具体吉凶如何？三合之年有哪些需要注意的呢？下面卜易居老师结合周易命理，给大家详细讲解属兔2019年运势及运程：</div>' +
            '<h6>属兔的人2019年运势综述</h6>' +
            '<p>1951年、1963年、1975年、1987年、1999年、2011年。<br>' +
            '属兔的朋友，今年的运程相当不俗，皆因有天喜、玉堂三颗吉星入主。太阴代表女性贵人，表示今年事业可得到不少女性贵人相助，对于未拍拖的男士而言，今年将会遇到不少桃花。天喜表示喜事重重，如果你正计划结婚、相当好有时机添丁，今年会是一个相当好的时机。至于玉堂，是有着才华得以发挥的意思，虎年出生的你，若是从事文化、创作等工作，那么今年你的灵感肯定源源不绝，思路清晰明敏。<br>' +
            '凶星方面，有勾神和贯索。勾神代表纠缠不清，贯索收暗示金钱苛索。两者相加起来，读者都可猜得到属兔者今年将会与别人有钱银上的瓜葛，导致因财失义。与朋友合伙投资、做生意，又或与伴侣合资置业等，起初还可相安无事，但到后来却会因为财务瓜葛而闹翻，这还不特止，事件到最后更可能需要诉诸法律行动，大家要对簿公堂。</p>' +
            '<h6>属兔的人2019年财运运势</h6>' +
            '<p>太阴是属兔人士今年的主星之一，此星代表女性贵人，若然你所从事的行业其目标顾客是以女性为主，例如化妆、美容、时装等，生意将有可观的收入。同时，太阴也包含着循序渐近的意思。财运方面，不会大上大落。而是细水长流，所以今年炒卖投机等赚快钱活动不宜沾手，要记着，太进取太搏杀的话，只会血本无归。</p>' +
            '<h6>属兔的人2019年事业运势</h6>' +
            '<p>属兔的打工一族，假如你的老板或上司是女性的话，她们对你的助力可不少。从事文化、创作行业者，例如传媒、广告等，由于玉堂代表着才华可得到发挥，所以你将会充满灵感、创意无穷，并得到别人的欣赏。若然野心太大，未学走先学跑，只会应付不来，欲速则不达。总的来说，今年发展事业的策略是宜静不宜动，尚在打稳根基的时候。</p>' +
            '<h6>属兔的人2019年感情运势</h6>' +
            '<p>由于太阴在位的关系，属兔男士今年的感情运比属兔女士好得多，未有拍拖者，将大有机会结识到理想对象，而这位女孩子的条件还相当不俗呢。此外，藉着她的人际关系网络，在事业上可助你一把。同时，她的贤淑敏慧在精神上又能支持你。要注意的是，由于太阴的影响较为慢热，所以就算遇上心仪对象，亦只可慢慢地发展，不能太过急进，至于属兔女士，桃花不太畅旺，已有对象者，能维持感情已算是不错了。没有拍拖的，可多些出入喜庆场所，可增加邂逅对象的机会。</p>' +
            '<h6>属兔的人2019年健康运势</h6>' +
            '<p>玉堂代表心情开朗，所以今年属兔的朋友精神状态非常好，就算以往有精神紧张、神经衰弱等问题，在猪年也能够舒缓过来。既是心广，自然体健，健康方面没大毛病，连伤风感冒、头晕都极少，只需稍注意喉咙、气管等呼吸系统或会敏感、发炎。开车的朋友呢，注意遵守交通规则，注意行车安全。</p>'
    },
    {
        msg:'<img src="../../assets/images/yunshi/pic10.png">' +
            '<div>属龙的人进入2019年猪年，属龙为辰土，猪年为亥水，从命理上讲，土克水为财，所以属龙今年走财星之运，吉星有紫微、龙德，所以财运上会有所起色。那么属龙人在2019年猪年运程的吉凶如何？运走财星之年有哪些需要注意的呢？下面卜易居老师结合周易命理，给大家详细讲解属龙2019年运势及运程：</div>' +
            '<h6>属龙的人2019年运势综述</h6>' +
            '<p>1952年、1964年、1976年、1988年、2000年、2012年。<br>' +
            '属龙的朋友，今年运势不俗，因为有三颗吉星入主，包括紫微、龙德。紫微及龙德是颇大的贵人星，代表得到长辈的提携，地位有所提升，表示事事顺利、得心应手，配合天时、地利、人和。事业运和财运都不俗。<br>' +
            '要留意的是，凶星方面，有暴败、天厄。暴败代表上落甚大，运势犹如过山车，高低起伏不定，极之颠簸。有些月份顺利得不能置信，本以为必定不能成功的事情，到最后竟然能水到渠成。有些月份则头头碰着黑，以为十拿九稳的工作，却遇阻碍重重，甚至临门失脚，故在此提醒属龙者今年审时度势，如有获益，落袋为安。</p>' +
            '<h6>属龙的人2019年财运运势</h6>' +
            '<p>属龙的人今年因为太岁逢合，贵人运不俗，做生意者会得到很多朋友的帮助，有很多赚钱机会，亦可能因为有人给予内幕消息，意见，让你赚一大笔。另外，又会得到不少合作机会让你能够借助对方的力量而大有进账。不过，由于受到暴败星的影响，绝对不适宜投机炒卖，否则便会三更富，五更穷。</p>' +
            '<h6>属龙的人2019年事业运势</h6>' +
            '<p>总括而言，属龙的你，今年有正财运，而凡别人带来的偏财也有，但仍要小心理财，不可太过急进，否则可能会是赢粒糖，输间厂。紫微代表地位提升、领导能力得到发挥，长辈的提携。三者加起来，简单而言，今年你可得到老板、上司的赏识，大有机会升职，然而，由于受岁煞所影响，赏你得到上司重用的同时，你却与同事、下属的关系不太好，招惹不少闲言是非。别人可能会觉得你只不过是由于拍马逢迎才能上位，也会认为你升职以后嚣张，宜跟他们多点沟通，便不会惹起不必要的误会。</p>' +
            '<h6>属龙的人2019年感情运势</h6>' +
            '<p>今年属龙人士的桃花颇重，注意这些桃花并不是跟旧友擦出来的，而是来自别的圈子，透过中间人介绍而结识到对象。未有拍拖的人士，极有机会遇到理想的对象，尤其是经由长辈介绍，不妨尝试相处，不少大好姻缘都是由此而来。不过，不要太过心急进取、采取疯狂攻势，只宜从做朋友开始，彼此慢慢观察了解，进而发展成为情侣。至于正在拍拖，甚至已经结婚的人士，与伴侣的关系相当不俗，今年将会是甜蜜愉快的一年，只是自己放了太多时间在工作上，以及情绪上落颇大，忽略了对方。</p>' +
            '<h6>属龙的人2019年健康运势</h6>' +
            '<p>属龙的人今年要多加留意肠胃健康，记着病口入，出门的时候，要小心饮食，否则容易肚痛，水土不服。建议随身备药物以备不时之需。就算是出外吃饭应酬，也应注意饮食，少吃生冷食物。另外，由于天厄、岁煞在位，今年你的身体容易受伤，故要避免参与颇具危险性的活动，攀山涉水可免则免，驾车人士要小心车辆出现问题而导致意外，抽空给车辆做检查吧！</p>'
    },
    {
        msg:'<img src="../../assets/images/yunshi/pic11.png">' +
            '<div>属蛇的人进入2019年猪年，属蛇为巳火，猪年为亥水，从地支上讲，亥巳相冲，也就是我们常说的冲太岁，所以属蛇人今年会有些起伏不顺。那么属蛇人在2019年猪年运程的吉凶如何？犯太岁之年如何化解，有哪些需要注意的呢？下面卜易居老师结合周易命理，给大家详细讲解属蛇2019年运势及运程：</div>' +
            '<h6>属蛇的人2019年运势综述</h6>' +
            '<p>1941年、1953年、1965年、1977年、1989年、2001年、2013年。<br>' +
            '属蛇的朋友今年犯太岁，而且是冲太岁。犯太岁者皆宜动不宜静，出外奔波走动，在所难免。玄学上常说一喜挡三灾，故属蛇人士若然于今年转工、搬屋、置业、结婚、添丁，都是好事。不过，举凡犯太岁者，都要有心理准备去面对变化，因运势较为反复，凡事宜作好两手准备，就算万一遇上阻滞都应付。2019年己亥太岁神为谢太大将军，在民间，新年有拜太岁的风俗，2019年犯太岁的缘友们可在2018年岁末，或2019年新年后，按照传统民俗奉请一件“福袋”摆放于家中或床头柜，寓意新年平平安安，祈福助运。<br>' +
            '对于属蛇人士而言，虽然吉星方面有禄勋入主，代表升职、加薪，事业有发展，但另一边，却也有着大耗、栏干、灾煞和岁破四颗凶星在作崇。大耗代表破财，容易花费大笔金钱。如果今年因置业或结婚等喜事而有大笔支出，也已算应验了破财劫。至于栏干和灾煞，是指工作方面会遇上困难重重，且易生枝节，你需要花多点时间、耐性去慢慢解决。</p>' +
            '<h6>属蛇的人2019年财运运势</h6>' +
            '<p>凡犯太岁者财运都比较反复，而属蛇者今年又遇上大耗和岁破，故要更加小心理财。大耗代表破财，尤其是对做生意的朋友而言，要特别留意的是，大型的投资项目和新业务今年你统统都不宜沾手，以安守本分为上。即使你已计算清楚，认为生意必赚无疑，可是结果却会是失手亏损，一败涂地。今年属蛇的你因受着阑干凶星所影响，做事会遇阻滞重重，即使生意上原本拥有一班长期熟客，然而他们却比以往难侍候，会有诸多挑剔。</p>' +
            '<h6>属蛇的人2019年事业运势</h6>' +
            '<p>属蛇的人今年犯太岁，但事业运尚算不俗。如果在工作上出现任何变动，例如转工、调职，又或是换上司，搬写字楼等，都已算应验了犯太岁宜动不宜静的运势。另外，如前文所说，禄勋代表升职、加薪，故蛇年出生的打工一族，今年虽然会较为奔波劳碌，工作压力也大，但你的努力必会得到回报，可受到上司的赏识重用之余，还大有机会步步高升呢！假如阁下真的想转工，今年是适当的时机，只要避开农历三月、九月便可。</p>' +
            '<h6>属蛇的人2019年感情运势</h6>' +
            '<p>属蛇人今年是运势上落颇大的一年，然而，一喜挡三灾。如果计划在今年内结婚、添丁，逆势便会变成顺势，否则，要慎防感情发生变化，因为岁破表示你跟身边的人士会出现沟通问题，就算以往彼此是多恩爱、多甜蜜，到了今年，也会频生拗撬，嫌隙渐大。至于还未拍拖，但已有心仪对象者，今年暂仍未能成其好事，这趟追求并非是这个他或她对你没意思，只是可能半途杀出个程咬金，或是有亲友作出反对，令你的感情之路障碍重重。</p>' +
            '<h6>属蛇的人2019年健康运势</h6>' +
            '<p>属蛇人今年流年与生肖相冲，属蛇者要注意今年手脚容易受伤，特别是膝盖、腰骨部位。故要避免参与具危险性的运动，水上活动尚可，至于攀岩、跳伞等则是不宜了。对于经常需要接触金属的人，要格外小心，工作时要做足安全措施，以防万一。驾车人士也要留心道路安全，最好为座驾作检查，以求安心。属蛇的女士要小心患上妇科病，所谓年验身，令你放心。另外，灾煞凶星的出现，代表属蛇者今年出门时易遇上危险，故凡出差或旅行前，记紧买下旅游保险，慎防万一出事也有保障。</p>'
    },
    {
        msg:'<img src="../../assets/images/yunshi/pic12.png">' +
            '<div>属马的人进入2019年猪年，属马为午火，猪年为亥水，从命理上讲，亥水克午火为官星，所以属马今年走官星之运，吉星有天德、文昌，所以官运或事业上会有所起色。那么属马人在2019年猪年运程的吉凶如何？走官星运之年有哪些需要注意的呢？下面卜易居老师结合周易命理，给大家详细讲解属马2019年运势及运程：</div>' +
            '<h6>属马的人2019年运势综述</h6>' +
            '<p>1942年、1954年、1966年、1978年、1990年、2002年、2014年。<br>' +
            '属马的朋友，今年有颇多吉星拱照，包括天德、文昌、福星和红鸾等。天德代表升职、加薪和有贵人帮助。文昌代表学习运强，有利考试，以及得到上级的提携。猪年出生的打工一族，今年的事业发展十分畅旺，可稳步向上，而既然有这么多的贵人帮助，不妨借助他们的力量，大展拳脚。<br>' +
            '在十二生肖当中，今年以属马的女生桃花最旺。由于官星入主，是感情结婚的大好时机，至于尚未拍拖的人士，因为有咸池桃花的关系，亦会有极大的机会遇上理想对象，惟要小心，在姻缘运极畅旺之时，可能要面对三角关系，尤其是已婚人士，更要小心处理感情事。<br>' +
            '整体运势大致向好，而且福星在位，表示今年你心情开朗，积极乐观，就算受着代表是非口舌所影响，你也觉得没什么大不了，只是由于应酬颇多，会令你健身不暇，以及花费颇多而已。</p>' +
            '<h6>属马的人2019年财运运势</h6>' +
            '<p>由于有很多贵人给予帮助，正财、偏财都有进账。除有升职、加薪机会之余，也可藉着所认识的权贵人士提供贴士指引，令投资方面大有斩获。不过，因为咸池代表人际关系十分好，所以你在今年会认识很多新朋友，交际圈子扩大了，令出外应酬也多了，而吃、喝、玩、乐的花费也会随之增加。幸而相对于收入来说，这些支出仅只是一小部分而已，未至于入不敷出。总括而言，财运入多过出，是有盈余的一年。</p>' +
            '<h6>属马的人2019年事业运势</h6>' +
            '<p>做生意的朋友，今年有很多的机会拓展业务，是大显身手的时候。至于打工一族，文昌代表考试、进步，即职位大有机会获得提升，而天德也表示升职、加薪。以上两颗吉星都属贵人星，所以属马的你今年将会受上司的重用、赏识以及提携。提点你要与同事多点沟通，不要自以为是，那么别人说什么，也不需要理会。总的来说，就算今年的工作繁重、阻力颇大，但一切都是值得的，事业将会大跃进。</p>' +
            '<h6>属马的人2019年感情运势</h6>' +
            '<p>这是感情生活多姿多彩的一年，因为大部分代表桃花的星宿，都落在属马人士今年的运势当中。正如前文所说，咸池桃花代表人缘极好。今年你所遇到的，都是你喜欢的人。若然未有伴侣的话，那么真的要恭喜你了，你将会遇上理想对象，而且选择甚多。正在拍拖的朋友，因为红鸾星动，所以结婚在家立室正是时候，不过，由于桃花太过畅旺，你将会受到很多引诱，容易出现三角关系。面对感情事，应该理智冷静。</p>' +
            '<h6>属马的人2019年健康运势</h6>' +
            '<p>福星代表乐观积极，凡事向好处想，而当心情变好，身体自然也健康！只是受绞煞所影响，喉咙、气管方面会出现小毛病。另外，今年会有颇多应酬令你疲于奔命，以致休息不太充足，饮食也没节制。只要好好分配时间、注意饮食均衡，健康便没问题。</p>'
    }
]